In [25]:
import pandas as pd

In [26]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'Dave', 'Eve'],
        'Age': [25, 30, None, 35, 40],
        'Salary': [50000, None, 60000, 70000, 80000]}
df = pd.DataFrame(data)

### Row data frame

In [27]:
df

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob  30.0      NaN
2  Charlie   NaN  60000.0
3     Dave  35.0  70000.0
4      Eve  40.0  80000.0

### Drop null values

In [28]:
df = df.dropna()

### Convert Age and Salary columns to integers

In [ ]:
df['Age'] = df['Age'].astype(int)
df['Salary'] = df['Salary'].astype(int)

### Add a new column based on Salary

In [ ]:
df['Salary Category'] = pd.cut(df['Salary'], bins=[0, 50000, 75000, 100000], labels=['Low', 'Medium', 'High'])

### Cleand Processed Data

In [22]:
df

    Name  Age  Salary Salary Category
0  Alice   25   50000             Low
3   Dave   35   70000          Medium
4    Eve   40   80000            High

In [24]:
print("@Jay Patel")

@Jay Patel